InformationRegisters/МобильноеПриложениеСканированиеЧеков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>МобильноеПриложениеСканированиеЧеков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКодаДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательШиныМобильныхПриложений</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ПомощникУстановкиМобильногоПриложенияСканированиеЧеков/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяПрограммы = ОбщегоНазначенияБП.ПредставлениеПрограммыВинительныйПадеж();
	
	Элементы.ДекорацияОписание2.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Элементы.ДекорацияОписание2.Заголовок,
		ИмяПрограммы);
		
	Элементы.ПодключениеСотрудниковОписание.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Элементы.ПодключениеСотрудниковОписание.Заголовок,
		ИмяПрограммы);
		
	Пользователь = Пользователи.ТекущийПользователь();
	
	ПараметрыТекста = Новый Структура;
	ПараметрыТекста.Вставить("КодДоступа", "");
	ПараметрыТекста.Вставить("Логин",      "");
	
	Если Пользователь = Пользователи.СсылкаНеуказанногоПользователя() Тогда
		ПараметрыТекста.Логин = НСтр("ru = 'адрес электронной почты'");
	Иначе
		ПараметрыТекста.Логин = СтрШаблон(НСтр("ru = 'логин <b>%1</b> и пароль'"), ИмяПользователя());
	КонецЕсли;
	
	МожноПодключатьПользователей = Ложь;
	ШаблонТекста = НСтр("ru = 'Для входа в мобильное приложение используйте свой [Логин]'");
	
	КодДоступа = РегистрыСведений.МобильноеПриложениеСканированиеЧеков.КодДоступа();
	
	Если КодДоступа <> Неопределено Тогда
		
		МожноПодключатьПользователей = Истина;
		ШаблонТекста = НСтр(
			"ru = 'Для входа в мобильное приложение используйте
             |- код доступа <a href=''КодДоступа''>[КодДоступа]</a>
             |или
             |- свой [Логин]'");
		ПараметрыТекста.КодДоступа = КодДоступа.Представление;
		
	КонецЕсли;
		
	СтрокаСТегами = СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(ШаблонТекста, ПараметрыТекста);
	Элементы.ДекорацияШаг2Заголовок.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(СтрокаСТегами);
	
	Элементы.ПодключениеПодотчетныхЛиц.Видимость = МожноПодключатьПользователей;
	
	Элементы.ГруппаБаннерУсловияИспользования.Видимость = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
		ВРег("ПомощникУстановкиМобильногоПриложенияСканированиеЧеков"),
		ВРег("УсловияИспользования"),
		Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДекорацияAndroidНажатие(Элемент)
	
	АдресСтраницы = "https://play.google.com/store/apps/details?id=com.e1c.ReceiptScanner";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияiOSНажатие(Элемент)
	
	АдресСтраницы = "https://apps.apple.com/ru/app/id1513613578";
	ПерейтиПоНавигационнойСсылке(АдресСтраницы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияШаг2ЗаголовокОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "КодДоступа" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("РегистрСведений.МобильноеПриложениеСканированиеЧеков.Форма.КодДоступа", , ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключениеСотрудниковНастройкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Пользователи" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("РегистрСведений.МобильноеПриложениеСканированиеЧеков.Форма.Пользователи", , ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БаннерУсловияИспользованияЗакрытьНажатие(Элемент)
	
	Элементы.ГруппаБаннерУсловияИспользования.Видимость = Ложь;
	СохранитьОтключениеВидимостиБаннераУсловияИспользования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СохранитьОтключениеВидимостиБаннераУсловияИспользования()
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		ВРег("ПомощникУстановкиМобильногоПриложенияСканированиеЧеков"), 
		ВРег("УсловияИспользования"), 
		Ложь);
	
КонецПроцедуры

#КонецОбласти
